Group By and Aggregate Function

In [2]:
'''
Aggregate Function 
-------------------
Mean ->Calculates average record
Max->Extracts maximum value from column
Sum->Calculates total value for column
Min->Extracts minimum value from column
Count->Count total number of record
'''

'\nAggregate Function \n-------------------\nMean ->Calculates average record\nMax->Extracts maximum value from column\nSum->Calculates total value for column\nMin->Extracts minimum value from column\nCount->Count total number of record\n'

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("Datas/Employees.csv")

In [5]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0

In [6]:
df.isnull().sum()

EMPLOYEE_ID        0
FIRST_NAME         0
LAST_NAME          0
EMAIL              0
PHONE_NUMBER       0
HIRE_DATE          0
JOB_ID             0
SALARY             0
COMMISSION_PCT    76
MANAGER_ID         1
DEPARTMENT_ID      1
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     111 non-null    int64
 1   FIRST_NAME      111 non-null    object
 2   LAST_NAME       111 non-null    object
 3   EMAIL           111 non-null    object
 4   PHONE_NUMBER    111 non-null    object
 5   HIRE_DATE       111 non-null    object
 6   JOB_ID          111 non-null    object
 7   SALARY          111 non-null    int64
 8   COMMISSION_PCT  35 non-null     float64
 9   MANAGER_ID      110 non-null    float64
 10  DEPARTMENT_ID   110 non-null    float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.7+ KB

In [8]:
df.shape

(111, 11)

In [9]:
#KPI(Key Performance Indicatar)

In [10]:
#Find total average salary of employees
average_salary = df['SALARY'].mean()
print(f"{average_salary:.2f}")

6560.58

In [11]:
#Find total salary
total_salary = df['SALARY'].sum()
total_salary

728224

In [12]:
#Find maximum salary
Highest = df['SALARY'].max()
Highest

24000

In [13]:
#Find minimum salary
Lowest = df['SALARY'].min()
Lowest

2100

In [16]:
#Count 
count_salary = df['SALARY'].count()
count_salary

111

In [28]:
total_unique_salary = df['SALARY'].nunique()
total_unique_salary

58

In [29]:
job_count = df['JOB_ID'].nunique()
job_count

19

In [31]:
job_count = df['JOB_ID'].value_counts()
job_count

JOB_ID
SA_REP        30
SH_CLERK      20
ST_CLERK      20
SA_MAN         5
IT_PROG        5
FI_ACCOUNT     5
PU_CLERK       5
ST_MAN         5
AC_MGR         2
PR_REP         2
HR_REP         2
AC_ACCOUNT     2
AD_VP          2
AD_ASST        1
MK_MAN         1
MK_REP         1
PU_MAN         1
FI_MGR         1
AD_PRES        1
Name: count, dtype: int64

Group By

In [35]:
#Find total salary of employees by each department
total = df.groupby('DEPARTMENT_ID')['SALARY'].sum()

In [37]:
total

DEPARTMENT_ID
10.0       4400
20.0      19000
30.0      24900
40.0      13000
50.0     156400
60.0      28800
70.0      20000
80.0     304500
90.0      58000
100.0     51608
110.0     40616
Name: SALARY, dtype: int64

In [39]:
total = df.groupby('DEPARTMENT_ID')['SALARY'].sum().reset_index()
total

    DEPARTMENT_ID  SALARY
0            10.0    4400
1            20.0   19000
2            30.0   24900
3            40.0   13000
4            50.0  156400
5            60.0   28800
6            70.0   20000
7            80.0  304500
8            90.0   58000
9           100.0   51608
10          110.0   40616

In [41]:
total = df.groupby('DEPARTMENT_ID')['SALARY'].count().reset_index()
total

    DEPARTMENT_ID  SALARY
0            10.0       1
1            20.0       2
2            30.0       6
3            40.0       2
4            50.0      45
5            60.0       5
6            70.0       2
7            80.0      34
8            90.0       3
9           100.0       6
10          110.0       4

In [43]:
#Find total salary ,average salary,max salary and min salary by job id
report = df.groupby('JOB_ID').agg(
    Total_Salary = ('SALARY','sum'),
    Average_Salary = ('SALARY','mean'),
    max_salary = ('SALARY','max'),
    min_salary = ('SALARY','min')
)

In [44]:
report

            Total_Salary  Average_Salary  max_salary  min_salary
JOB_ID
AC_ACCOUNT         16600          8300.0        8300        8300
AC_MGR             24016         12008.0       12008       12008
AD_ASST             4400          4400.0        4400        4400
AD_PRES            24000         24000.0       24000       24000
AD_VP              34000         17000.0       17000       17000
FI_ACCOUNT         39600          7920.0        9000        6900
FI_MGR             12008         12008.0       12008       12008
HR_REP             13000          6500.0        6500        6500
IT_PROG            28800          5760.0        9000        4200
MK_MAN             13000         13000.0       13000       13000
MK_REP              6000          6000.0        6000        6000
PR_REP             20000         10000.0       10000       10000
PU_CLERK           13900          2780.0        3100        2500
PU_MAN             11000         11000.0       11000       11000
SA_MAN             61000         12200.0       14000       10500
SA_REP            250500          8350.0       11500        6100
SH_CLERK           64300          3215.0        4200        2500
ST_CLERK           55700          2785.0        3600        2100
ST_MAN             36400          7280.0        8200        5800

In [47]:
#Find total salary ,average salary,max salary and min salary by job id and get the index as numbers

report = df.groupby('JOB_ID').agg(
    Total_Salary = ('SALARY','sum'),
    Average_Salary = ('SALARY','mean'),
    max_salary = ('SALARY','max'),
    min_salary = ('SALARY','min')
).reset_index()

In [49]:
report

        JOB_ID  Total_Salary  Average_Salary  max_salary  min_salary
0   AC_ACCOUNT         16600          8300.0        8300        8300
1       AC_MGR         24016         12008.0       12008       12008
2      AD_ASST          4400          4400.0        4400        4400
3      AD_PRES         24000         24000.0       24000       24000
4        AD_VP         34000         17000.0       17000       17000
5   FI_ACCOUNT         39600          7920.0        9000        6900
6       FI_MGR         12008         12008.0       12008       12008
7       HR_REP         13000          6500.0        6500        6500
8      IT_PROG         28800          5760.0        9000        4200
9       MK_MAN         13000         13000.0       13000       13000
10      MK_REP          6000          6000.0        6000        6000
11      PR_REP         20000         10000.0       10000       10000
12    PU_CLERK         13900          2780.0        3100        2500
13      PU_MAN         11000         11000.0       11000       11000
14      SA_MAN         61000         12200.0       14000       10500
15      SA_REP        250500          8350.0       11500        6100
16    SH_CLERK         64300          3215.0        4200        2500
17    ST_CLERK         55700          2785.0        3600        2100
18      ST_MAN         36400          7280.0        8200        5800

In [51]:
#Find total number of pizza sold by pizza category
#Find total number of pizza sold by pizza size
#find total sales by each month
#Find total unit price,average unit price of pizza sales by pizza category

In [53]:
data = pd.read_csv("Datas/pizza_sales.csv")
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

In [55]:
data.columns

Index(['pizza_id', 'order_id', 'pizza_name_id', 'quantity', 'order_date',
       'order_time', 'unit_price', 'total_price', 'pizza_size',
       'pizza_category', 'pizza_ingredients', 'pizza_name'],
      dtype='object')

In [57]:
#Find total number of pizza sold by pizza category
pizza_count = data.groupby('pizza_category')['order_id'].count().reset_index()
pizza_count

  pizza_category  order_id
0        Chicken     10815
1        Classic     14579
2        Supreme     11777
3         Veggie     11449

In [59]:
pizzasize_count = data.groupby('pizza_size')['order_id'].count()
pizzasize_count

pizza_size
L      18526
M      15385
S      14137
XL       544
XXL       28
Name: order_id, dtype: int64

In [109]:
#find total sales by each month
data['order_date']= pd.to_datetime(data['order_date'],format =  'mixed')
data['Month'] = data['order_date'].dt.month_name()
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,Month
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,January
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,January
2,3,2,five_cheese_l,1,2015-01-01,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,January
3,4,2,ital_supr_l,1,2015-01-01,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,January
4,5,2,mexicana_m,1,2015-01-01,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,January

In [118]:
total_month = data.groupby('Month')['order_id'].count().reset_index()
total_month

        Month  order_id
0       April      4182
1      August      4141
2    December      3622
3    February      3821
4     January      4288
5        July      4212
6        June      4044
7       March      4251
8         May      4008
9    November      4226
10    October      4045
11  September      3780

In [139]:
#Find total sales by each day
data['Day']=data['order_date'].dt.day_name()
data.head()
total_day = data.groupby('Day')['order_id'].count().reset_index()
total_day

         Day  order_id
0     Friday      7723
1     Monday      6577
2   Saturday      7274
3     Sunday      6063
4   Thursday      7243
5    Tuesday      6833
6  Wednesday      6907

In [114]:
#Find total unit price,average unit price of pizza sales by pizza category
Details = data.groupby('pizza_category').agg(
    Total_unit_price = ('unit_price','sum'),
    Average_unit_price = ('unit_price','mean')
    
).reset_index()

In [116]:
Details

  pizza_category  Total_unit_price  Average_unit_price
0        Chicken         191527.25           17.709408
1        Classic         215732.60           14.797490
2        Supreme         204486.75           17.363229
3         Veggie         190198.10           16.612639

In [74]:
#Find total salary ,average salary of employees by JOB_ID and Department_id

In [76]:
df

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
106,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0
107,203,Susan,Mavris,SMAVRIS,515.123.7777,07.06.2002,HR_REP,6500,NaN,101.0,40.0
108,204,Hermann,Baer,HBAER,515.123.8888,07.06.2002,PR_REP,10000,NaN,101.0,70.0
109,205,Shelley,Higgins,SHIGGINS,515.123.8080,07.06.2002,AC_MGR,12008,NaN,101.0,110.0
110,206,William,Gietz,WGIETZ,515.123.8181,07.06.2002,AC_ACCOUNT,8300,NaN,205.0,110.0

In [99]:
emp_salary = df.groupby(['JOB_ID','DEPARTMENT_ID'])['SALARY'].agg(['sum','mean']).reset_index()

In [101]:
emp_salary

        JOB_ID  DEPARTMENT_ID     sum          mean
0   AC_ACCOUNT          110.0   16600   8300.000000
1       AC_MGR          110.0   24016  12008.000000
2      AD_ASST           10.0    4400   4400.000000
3      AD_PRES           90.0   24000  24000.000000
4        AD_VP           90.0   34000  17000.000000
5   FI_ACCOUNT          100.0   39600   7920.000000
6       FI_MGR          100.0   12008  12008.000000
7       HR_REP           40.0   13000   6500.000000
8      IT_PROG           60.0   28800   5760.000000
9       MK_MAN           20.0   13000  13000.000000
10      MK_REP           20.0    6000   6000.000000
11      PR_REP           70.0   20000  10000.000000
12    PU_CLERK           30.0   13900   2780.000000
13      PU_MAN           30.0   11000  11000.000000
14      SA_MAN           80.0   61000  12200.000000
15      SA_REP           80.0  243500   8396.551724
16    SH_CLERK           50.0   64300   3215.000000
17    ST_CLERK           50.0   55700   2785.000000
18      ST_MAN           50.0   36400   7280.000000

Custom Category

In [231]:
weekday = ['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday']
data['Day']= pd.Categorical(data['Day'],categories = weekday)

KeyError: 'Day'

In [233]:
data['Day'].unique()

KeyError: 'Day'

In [147]:
total_day = data.groupby('Day',observed = False)['order_id'].count().reset_index()
total_day

         Day  order_id
0     Sunday      6063
1     Monday      6577
2    Tuesday      6833
3  Wednesday      6907
4   Thursday      7243
5     Friday      7723
6   Saturday      7274

In [149]:
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,Month,Day
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,January,Thursday
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,January,Thursday
2,3,2,five_cheese_l,1,2015-01-01,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,January,Thursday
3,4,2,ital_supr_l,1,2015-01-01,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,January,Thursday
4,5,2,mexicana_m,1,2015-01-01,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,January,Thursday

In [211]:
data = pd.read_csv("Datas/pizza_sales.csv")
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

In [215]:
data['order_time']= pd.to_datetime(data['order_time'], format='%H:%M:%S')

In [237]:
data['order_date']= pd.to_datetime(data['order_date'],format =  'mixed')
data['Day']=data['order_date'].dt.day_name()

In [239]:
weekday = ['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday']
data['Day']= pd.Categorical(data['Day'],categories = weekday)

In [241]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48620 entries, 0 to 48619
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   pizza_id           48620 non-null  int64
 1   order_id           48620 non-null  int64
 2   pizza_name_id      48620 non-null  object
 3   quantity           48620 non-null  int64
 4   order_date         48620 non-null  datetime64[ns]
 5   order_time         48620 non-null  datetime64[ns]
 6   unit_price         48620 non-null  float64
 7   total_price        48620 non-null  float64
 8   pizza_size         48620 non-null  object
 9   pizza_category     48620 non-null  object
 10  pizza_ingredients  48620 non-null  object
 11  pizza_name         48620 non-null  object
 12  Hour               48620 non-null  int32
 13  Minute             48620 non-null  int32
 14  Second             48620 non-null  int32
 15  Day                48620 non-null  category
dtypes: category(1), datetime64[ns](2), float64(2), int32(3), int64(3), object(5)
memory usage: 5.1+ MB

In [219]:
data['Hour']= data['order_time'].dt.hour

In [221]:
data['Minute']= data['order_time'].dt.minute

In [223]:
data['Second']= data['order_time'].dt.second

In [225]:
data.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,Hour,Minute,Second
0,1,1,hawaiian_m,1,1/1/2015,2025-12-18 11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,11,38,36
1,2,2,classic_dlx_m,1,1/1/2015,2025-12-18 11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,11,57,40
2,3,2,five_cheese_l,1,1/1/2015,2025-12-18 11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,11,57,40
3,4,2,ital_supr_l,1,1/1/2015,2025-12-18 11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,11,57,40
4,5,2,mexicana_m,1,1/1/2015,2025-12-18 11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,11,57,40

In [253]:
Report = data.groupby(['Day','Hour'], observed=False).agg(
    Total_revenue_by_hour=('total_price','sum'),
    Average_revenue_by_hour=('total_price','mean')    
).reset_index()

In [255]:
Report

          Day  Hour  Total_revenue_by_hour  Average_revenue_by_hour
0      Sunday     9                   0.00                      NaN
1      Sunday    10                  20.75                20.750000
2      Sunday    11                4345.90                17.314343
3      Sunday    12               11947.75                17.191007
4      Sunday    13               13245.00                17.519841
..        ...   ...                    ...                      ...
100  Saturday    19               12568.30                16.757733
101  Saturday    20               11494.75                16.659058
102  Saturday    21                8498.10                16.662941
103  Saturday    22                4945.00                16.706081
104  Saturday    23                 367.70                16.713636

[105 rows x 4 columns]

In [257]:
day_filter = Report['Day']=='Tuesday'
Report[day_filter]

        Day  Hour  Total_revenue_by_hour  Average_revenue_by_hour
30  Tuesday     9                  83.00                20.750000
31  Tuesday    10                   0.00                      NaN
32  Tuesday    11                6267.20                16.712533
33  Tuesday    12               16984.50                17.473765
34  Tuesday    13               15971.65                17.136964
35  Tuesday    14                7825.25                16.756424
36  Tuesday    15                8510.35                16.719745
37  Tuesday    16               10587.20                17.159157
38  Tuesday    17               11472.35                16.796999
39  Tuesday    18               12193.25                16.544437
40  Tuesday    19               10183.75                16.749589
41  Tuesday    20                7081.75                16.623826
42  Tuesday    21                5546.70                16.757402
43  Tuesday    22                2786.00                16.783133
44  Tuesday    23                 101.50                16.916667

In [259]:
day_filter = Report['Day']=='Sunday'
Report[day_filter]

       Day  Hour  Total_revenue_by_hour  Average_revenue_by_hour
0   Sunday     9                   0.00                      NaN
1   Sunday    10                  20.75                20.750000
2   Sunday    11                4345.90                17.314343
3   Sunday    12               11947.75                17.191007
4   Sunday    13               13245.00                17.519841
5   Sunday    14                7935.45                16.706211
6   Sunday    15                8080.30                16.869102
7   Sunday    16                9188.65                16.291933
8   Sunday    17               11496.90                16.734934
9   Sunday    18               11800.45                16.714518
10  Sunday    19                9397.90                16.574780
11  Sunday    20                7428.85                16.656614
12  Sunday    21                4952.15                16.617953
13  Sunday    22                2167.40                16.545038
14  Sunday    23                 109.00                15.571429